Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
        case AutoState::MOVE:
            if (!autoMotionStarted) {
                startCurrentProgramPoint();
                if (robot.autoState == AutoState::FAULT) return;
            }

            if (autoMotionStarted && motionFinished()) {
                autoMotionStarted = false;
                autoDwellStartedMs = millis();
                robot.autoState = AutoState::DWELL;
            }
            break;

        case AutoState::DWELL: {
            const uint32_t dwell = programPoints[currentProgramPoint].dwellMs;
            if (millis() - autoDwellStartedMs < dwell) return;

            currentProgramPoint++;
            if (currentProgramPoint >= programPointCount) {
                if (AUTO_LOOP_PROGRAM) {
                    currentProgramPoint = 0;
                    Serial.println("AUTO: kolejny cykl");
                } else {
                    robot.autoState = AutoState::FINISHED;
                    Serial.println("AUTO: program zakończony");
                    return;
                }
            }

            robot.autoState = AutoState::MOVE;
            autoMotionStarted = false;
            break;
        }
    }
}

// ============================================================
// E-STOP
// ============================================================
void updateEmergencyStop() {
    const bool estopActive = digitalRead(PIN_ESTOP) == HIGH;

    if (estopActive && !robot.estopLatched) {
        robot.estopLatched = true;
        robot.gamepadArmed = false;
        emergencyStopMotion();
        robot.autoState = AutoState::FAULT;
        digitalWrite(PIN_LED_ERROR, HIGH);
        digitalWrite(PIN_LED_STATUS, LOW);
        Serial.println("E-STOP AKTYWNY - wymagany restart sterownika");
    }
}

// ============================================================
// TRYBY / PANEL
// ============================================================
void toggleControlMode() {
    if (robot.estopLatched || !robot.gamepadArmed ||
        robot.operatingMode != OperatingMode::MANUAL) return;

    robot.controlMode =
        (robot.controlMode == ControlMode::JOINT) ? ControlMode::TOOL : ControlMode::JOINT;

    Serial.println(robot.controlMode == ControlMode::TOOL ? "MANUAL: TOOL" : "MANUAL: JOINT");
}

void toggleOperatingMode() {
    if (robot.estopLatched) return;
    if (axesRunning()) {
        Serial.println("MODE: zatrzymaj osie przed zmianą MANUAL/AUTO");
        return;
    }

    if (robot.operatingMode == OperatingMode::MANUAL) {
        robot.operatingMode = OperatingMode::AUTO;
        robot.autoState = AutoState::IDLE;
        robot.gamepadArmed = false;
        previousPadStart = false;
        Serial.printf("Tryb pracy: AUTO (%u punktów). START = uruchom/pauza\n",
                      programPointCount);
    } else {
        emergencyStopMotion();
        robot.operatingMode = OperatingMode::MANUAL;
        robot.autoState = AutoState::IDLE;
        autoMotionStarted = false;
        robot.gamepadArmed = false;
        gamepadNeutralSinceMs = 0;
        previousPadStart = false;
        updateActualRobotPosition();
        robot.joints = robot.actualJoints;
        robot.tcp = robot.actualTcp;
        Serial.println("Tryb pracy: MANUAL - oczekiwanie na neutralny pad");
    }

    digitalWrite(PIN_LED_STATUS,
                 robot.operatingMode == OperatingMode::AUTO ? HIGH : LOW);
}

void printCurrentPosition() {
    updateActualRobotPosition();

    Serial.println();
    Serial.println("----- STAN ROBOTA -----");
    Serial.printf("A1 ACT/CMD: %.2f / %.2f deg\n",
                  robot.actualJoints.arm1Deg, robot.joints.arm1Deg);
    Serial.printf("A2 ACT/CMD: %.2f / %.2f deg\n",
                  robot.actualJoints.arm2Deg, robot.joints.arm2Deg);
    Serial.printf("Z  ACT/CMD: %.2f / %.2f mm\n",
                  robot.actualJoints.zMm, robot.joints.zMm);
    Serial.printf("TCP ACT X/Y: %.2f / %.2f mm\n",
                  robot.actualTcp.xMm, robot.actualTcp.yMm);
    Serial.printf("ROT: %.1f  GRIP: %.1f\n",
                  robot.toolRotateDeg, robot.gripperDeg);
    Serial.printf("WORK: %s  MANUAL: %s\n",
                  robot.operatingMode == OperatingMode::AUTO ? "AUTO" : "MANUAL",
                  robot.controlMode == ControlMode::TOOL ? "TOOL" : "JOINT");
    Serial.printf("TEACH points: %u/%u\n", programPointCount, MAX_PROGRAM_POINTS);
    Serial.printf("Pad: %s\n", robot.gamepadArmed ? "ARMED" : "SAFE");
    Serial.println("-----------------------");
}

void updatePanelButtons() {
    const uint32_t now = millis();
    const bool modeButton = digitalRead(PIN_BUTTON_MODE);
    const bool teachButton = digitalRead(PIN_BUTTON_TEACH);

    if (previousModeButton == HIGH && modeButton == LOW &&
        now - lastModeButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastModeButtonEdgeMs = now;
        toggleOperatingMode();
    }

    // TEACH na płytce jest aktywny stanem HIGH.
    if (previousTeachButton == LOW && teachButton == HIGH &&
        now - lastTeachButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastTeachButtonEdgeMs = now;
        teachPressStartedMs = now;
    }

    if (previousTeachButton == HIGH && teachButton == LOW &&
        now - lastTeachButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastTeachButtonEdgeMs = now;

        if (teachPressStartedMs != 0) {
            const uint32_t heldMs = now - teachPressStartedMs;
            if (heldMs >= TEACH_LONG_PRESS_MS) {
                clearProgram();
            } else {
                teachCurrentPoint();
            }
        }

        teachPressStartedMs = 0;
    }

    previousModeButton = modeButton;
    previousTeachButton = teachButton;
}

// ============================================================
// BLUEPAD32
// ============================================================
ControllerPtr getActiveController() {
    for (ControllerPtr controller : controllers) {
        if (controller != nullptr && controller->isConnected() && controller->isGamepad()) {
            return controller;
        }
    }
    return nullptr;
}

void updateControllerConnectedFlag() {
    robot.controllerConnected = getActiveController() != nullptr;
    digitalWrite(PIN_LED_BT, robot.controllerConnected ? HIGH : LOW);
}

